#企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
#利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元
#的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；
#40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于
#60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
#从键盘输入当月利润I，求应发放奖金总数？

def pension():
    sales = int(input("请输入您的销售额："))
    if sales<=100000:
        print("您的奖金是",sales*0.1)
    elif sales<=200000:
        print("您的奖金是",10000+(sales-100000)*0.075)
    elif sales<=400000:
        print("您的奖金是",17500+(sales-200000)*0.05)
    elif sales<=600000:
        print("您的奖金是",27500+(sales-400000)*0.03)
    elif sales<=1000000:
        print("您的奖金是",33500+(sales-600000)*0.015)
    else:
        print("您的奖金是",39500+(sales-1000000)*0.01)
        
pension()        

                
